[
	{"name":"Limit.1",
	"description":"I can calculate average rate of change of a function on a given interval and can explain its meaning in context.",
	"value":1,
	"num_demonstrations":2},
	{"name":"Limit.2",
	"description":"I can use limit notation correctly and can evaluate a limit (at a point or at infinity) graphically, numerically, and using algebra.",
	"value":2,
	"num_demonstrations":2},
	{"name":"Limit.3",
	"description":"I can recognize points at which a function is and is not continuous, can classify discontinuities, and can use the language of limits to support my thinking.",
	"value":1,
	"num_demonstrations":2},
	{"name":"Limit.4",
	"description":"I can explain the relationship between average and instantaneous rates of change and can support my thinking with the language of tangent lines, secant lines, limits, and derivatives.",
	"value":2,
	"num_demonstrations":2},
	{"name":"Limit.5",
	"description":"I can write out the correct limit expression that would compute the derivative of a function (at a point or in general) and can evaluate the limit to compute a derivative without using shortcuts.",
	"value":1,
	"num_demonstrations":2},

	{"name":"Deriv.1",
	"description":"I can use derivative notation correctly and can compute derivatives for sums, constant multiples, and power functions.",
	"value":1,
	"num_demonstrations":2},
	{"name":"Deriv.2",
	"description":"I can correctly differentiate basic functions including polynomials and power functions, exponential and logarithmic functions, and trigonometric functions.",
	"value":1,
	"num_demonstrations":2},
	{"name":"Deriv.3",
	"description":"I can differentiate combinations of basic functions using the product rule, quotient rule, and chain rule.",
	"value":2,
	"num_demonstrations":2},
	{"name":"Deriv.4",
	"description":"I can apply two or more derivative rules to differentiate a single function.",
	"value":1,
	"num_demonstrations":2},
	{"name":"Deriv.5",
	"description":"I can correctly compute the formulas and values of derivatives of functions with multiple variables using implicit differentiation.",
	"value":2,
	"num_demonstrations":2},

	{"name":"ApplDer.1",
	"description":"I can justify the use of and correctly apply L'Hôpital's rule to evaluate limits.",
	"value":1,
	"num_demonstrations":2},
	{"name":"ApplDer.2",
	"description":"I can set up and solve related rates problems completely and correctly.",
	"value":2,
	"num_demonstrations":2},
	{"name":"ApplDer.3",
	"description":"I can identify and classify local and absolute extrema of a function and can explain the difference between the two.",
	"value":1,
	"num_demonstrations":2},
	{"name":"ApplDer.4",
	"description":"I can conduct first and second derivative tests and use that information to describe key behavior and important features of the original function, and I can use derivatives to sketch the original function",
	"value":2,
	"num_demonstrations":2},
	{"name":"ApplDer.5",
	"description":"I can use a function and its derivatives to describe the position, velocity, and acceleration of an object in motion.",
	"value":1,
	"num_demonstrations":2},
	{"name":"ApplDer.6",
	"description":"I can set up and solve applied optimization problems completely and correctly.",
	"value":2,
	"num_demonstrations":2},

	{"name":"Int.1",
	"description":"I can use geometry to evaluate a definite integral exactly, and can use Riemann sums to estimate the value of a definite integral; I can explain the relative validity of estimations.",
	"value":2,
	"num_demonstrations":2},
	{"name":"Int.2",
	"description":"I can use integral notation correctly and can anti-differentiate combinations of basic functions.",
	"value":1,
	"num_demonstrations":2},
	{"name":"Int.3",
	"description":"I can describe the Fundamental Theorem of Calculus and can use both formulations of it to correctly integrate and differentiate functions.",
	"value":2,
	"num_demonstrations":2},
	{"name":"Int.4",
	"description":"I can use a rate of change function and integration to determine total and net change and explain their meanings in context.",
	"value":1,
	"num_demonstrations":2},
	{"name":"Int.5",
	"description":"I can recognize the need for and correctly use substitution to compute definite and indefinite integrals.",
	"value":1,
	"num_demonstrations":1}
]
